## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # null_resource.cluster1_hub_mesh_update is tainted, so must be replaced
-/+ resource "null_resource" "cluster1_hub_mesh_update" {
!       id       = "7615170632457226721" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.asm.google_gke_hub_feature.mesh[0] will be created
+   resource "google_gke_hub_feature" "mesh" {
+       create_time    = (known after apply)
+       delete_time    = (known after apply)
+       id             = (known after apply)
+       location       = "global"
+       name           = "servicemesh"
+       project        = "terrateam-362405"
+       resource_state = (known after apply)
+       state          = (known after apply)
+       update_time    = (known after apply)
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] is tainted, so must be replaced
-/+ resource "null_resource" "run_command" {
!       id       = "6264399877000496741" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
